namespace Const
{
    /// <summary>敵に関する定数を保持するクラス</summary>
    public static class EnemyConst
    {
        //-------------------------------------------------------------------------------
        // タグ
        //-------------------------------------------------------------------------------
        
        public const string TagName = "Enemy";
        
        //-------------------------------------------------------------------------------
        // アニメーションステート
        //-------------------------------------------------------------------------------
        
        public const string HitState = "Hit"; // 被ダメージ
        public const string DownState = "Down"; // 弱体化
        public const string DieState = "Die"; // 死亡
        
        //-------------------------------------------------------------------------------
        // アニメーションフラグ
        //-------------------------------------------------------------------------------

        public const string IsMoving = "Is Moving"; // 移動
    }
}