namespace Const
{
    /// <summary>インゲームに関する定数をまとめたクラス</summary>
    public static class InGameConst
    {
        //-------------------------------------------------------------------------------
        // タグ
        //-------------------------------------------------------------------------------
        
        public const string PlayerTag = "Player"; // プレイヤーのゲームオブジェクトに付けるタグ
        
        //-------------------------------------------------------------------------------
        // アニメーションステート
        //-------------------------------------------------------------------------------
        
        public const string EnemyStunAnimation = "Stun"; // 敵のスタンアニメーションのステート
        
        //-------------------------------------------------------------------------------
        // アニメーションフラグ
        //-------------------------------------------------------------------------------

        public const string EnemyMoveFlag = "Move Flag"; // 敵の移動フラグ
    }
}