namespace Const
{
    /// <summary>インゲームに関する定数をまとめたクラス</summary>
    public static class InGameConst
    {
        //-------------------------------------------------------------------------------
        // タグ
        //-------------------------------------------------------------------------------
        
        public const string PlayerTag = "Player"; // プレイヤーのタグ
        
        //-------------------------------------------------------------------------------
        // アニメーションステート
        //-------------------------------------------------------------------------------
        
        public const string EnemyStunAnimation = "Stun"; // 敵のスタン
        
        //-------------------------------------------------------------------------------
        // アニメーションフラグ
        //-------------------------------------------------------------------------------

        public const string EnemyMoveFlag = "Move Flag"; // 敵の移動
        public const string PlayerMoveFlag = "Move Flag"; // プレイヤーの移動
        
        //-------------------------------------------------------------------------------
        // アニメーショントリガー
        //-------------------------------------------------------------------------------
        
        public const string PlayerParryTrigger = "Parry Trigger"; // プレイヤーのパリィ
        public const string PlayerDashTrigger = "Dash Trigger"; // プレイヤーのダッシュ
    }
}