namespace Const
{
    /// <summary>プレイヤーに関する定数を保持するクラス</summary>
    public static class PlayerConst
    {
        //-------------------------------------------------------------------------------
        // タグ
        //-------------------------------------------------------------------------------
        
        public const string TagName = "Player";
        
        //-------------------------------------------------------------------------------
        // アニメーションステート
        //-------------------------------------------------------------------------------

        public const string LightHitState = "Light Hit"; // 被ダメージ（軽）
        public const string HeavyHitState = "Heavy Hit"; // 被ダメージ（重）
        public const string DieState = "Die"; // 死亡
        
        //-------------------------------------------------------------------------------
        // アニメーションフラグ
        //-------------------------------------------------------------------------------
        
        public const string IsMoving = "Is Moving"; // 移動
        public const string IsSprinting = "Is Sprinting"; // スプリント
        
        //-------------------------------------------------------------------------------
        // アニメーショントリガー
        //-------------------------------------------------------------------------------
        
        public const string ParryTrigger = "Parry"; // パリィ
        public const string DodgeTrigger = "Dodge"; // 回避
        
        //-------------------------------------------------------------------------------
        // アニメーションパラメーター
        //-------------------------------------------------------------------------------
        
        public const string MoveInputX = "Move Input X"; // 移動の入力値
        public const string MoveInputY = "Move Input Y"; // 移動の入力値
    }
}